/*******************************************************************************

                      版权所有 (C), 2017-, Mushiny
                      
 *******************************************************************************
  文 件 名   : connect_task.c
  版 本 号   : 初稿
  作    者   : LJM
  生成日期   : 2017.12.26
  最近修改   :
  功能描述   : 状态显示任务
               本系统编程时需要注意:
               >>凡是用了raw_printf()的task，一定要注意raw_printf是需要动态变量数组的，
                 所以task的任务堆栈必须能满足要求，最好要128或256以上
  函数列表   :
*******************************************************************************/
/* 包含头文件 ----------------------------------------------------------------*/
#include "app.h"

/* 内部自定义数据类型 --------------------------------------------------------*/
/* 内部宏定义 ----------------------------------------------------------------*/

/* 任务相关信息定义-----------------------------------------------------------*/
#define CONNECT_STK_SIZE		128
OS_TCB	CONNECTTaskTCB;
CPU_STK	CONNECT_TASK_STK[CONNECT_STK_SIZE];

/* 内部常量定义---------------------------------------------------------------*/

/* 外部变量声明 --------------------------------------------------------------*/

/* 外部函数原型声明 ----------------------------------------------------------*/

/* 内部变量 ------------------------------------------------------------------*/

/* 内部函数原型声明 ----------------------------------------------------------*/
/* 任务主体部分 --------------------------------------------------------------*/
static void connect_task(void *p_arg)
{	  	
	while(1)
	{	 			        
	 p_arg = p_arg;//任务函数输入参数，此写法是防止编译器因为未使用变量而进行警告
		 switch(Robot_Mode)
	 {
		 case MATCH_MODE:{
	
		                 }break;                       //比赛模式
		 case THROW_MODE:{

		                 }break;                        //抛掷模式
		 case CONNECT_MODE:{ 
		
		                   }break;                      //交接模式
	 }   	
	 delay_ms(10);
  }
}

void create_connect_task(uint8_t prio)
{
  OS_ERR  err;	
	OSTaskCreate((OS_TCB 	* )&CONNECTTaskTCB,		
				 (CPU_CHAR	* )"CONNECT test task", 		
                 (OS_TASK_PTR )connect_task, 			
                 (void		* )0,					
                 (OS_PRIO	  )prio,     	
                 (CPU_STK   * )&CONNECT_TASK_STK[0],	
                 (CPU_STK_SIZE)CONNECT_STK_SIZE/10,	
                 (CPU_STK_SIZE)CONNECT_STK_SIZE,		
                 (OS_MSG_QTY  )0,					
                 (OS_TICK	  )0,					
                 (void   	* )0,				
                 (OS_OPT      )OS_OPT_TASK_STK_CHK|OS_OPT_TASK_STK_CLR, 
                 (OS_ERR 	* )&err);				 
}

/************/