/*******************************************************************************

                      版权所有 (C), 2017-, Mushiny
                      
 *******************************************************************************
  文 件 名   : IWDG_task.c
  版 本 号   : 初稿
  作    者   : LJM
  生成日期   : 2017.12.26
  最近修改   :
  功能描述   : 看门狗任务
               本系统编程时需要注意:
               >>凡是用了raw_printf()的task，一定要注意raw_printf是需要动态变量数组的，
                 所以task的任务堆栈必须能满足要求，最好要128或256以上
  函数列表   :
*******************************************************************************/
/* 包含头文件 ----------------------------------------------------------------*/
#include "app.h"

/* 内部自定义数据类型 --------------------------------------------------------*/
/* 内部宏定义 ----------------------------------------------------------------*/

/* 任务相关信息定义-----------------------------------------------------------*/
#define IWDG_STK_SIZE		128
OS_TCB	IWDGTaskTCB;
CPU_STK	IWDG_TASK_STK[IWDG_STK_SIZE];

/* 内部常量定义---------------------------------------------------------------*/

/* 外部变量声明 --------------------------------------------------------------*/

/* 外部函数原型声明 ----------------------------------------------------------*/

/* 内部变量 ------------------------------------------------------------------*/

/* 内部函数原型声明 ----------------------------------------------------------*/
void IWDG_Feed(void)
{
	IWDG_ReloadCounter();//reload
}
/* 任务主体部分 --------------------------------------------------------------*/
static void IWDG_task(void *p_arg)
{	  	
//	CPU_SR_ALLOC();
	while(1)
	{
	 	IWDG_Feed();		    
    delay_ms(100);
	}
}

void create_IWDG_task(uint8_t prio)
{
  OS_ERR  err;	
	OSTaskCreate((OS_TCB 	* )&IWDGTaskTCB,		
				 (CPU_CHAR	* )"IWDG test task", 		
                 (OS_TASK_PTR )IWDG_task, 			
                 (void		* )0,					
                 (OS_PRIO	  )prio,     	
                 (CPU_STK   * )&IWDG_TASK_STK[0],	
                 (CPU_STK_SIZE)IWDG_STK_SIZE/10,	
                 (CPU_STK_SIZE)IWDG_STK_SIZE,		
                 (OS_MSG_QTY  )0,					
                 (OS_TICK	  )0,					
                 (void   	* )0,				
                 (OS_OPT      )OS_OPT_TASK_STK_CHK|OS_OPT_TASK_STK_CLR, 
                 (OS_ERR 	* )&err);				 
}

/************** 版权所有 (C), 2017-, Mushiny **********本文件结束*************/

